Ran Plan for 2 projects:

1. dir: `anotherdir` workspace: `default`
1. dir: `subdir` workspace: `default`

### 1. dir: `anotherdir` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

  # module.random.random_id.test will be created
+ resource "random_id" "test" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ random_string = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d anotherdir`
* :put_litter_in_its_place: To **delete** this plan click [here](https://237ac4eee77d.ngrok.io/lock?id=leg100%252Fetok-example%252Fanotherdir%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d anotherdir`
</details>

---
### 2. dir: `subdir` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

  # module.random.random_id.test will be created
+ resource "random_id" "test" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ random_string = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d subdir`
* :put_litter_in_its_place: To **delete** this plan click [here](https://237ac4eee77d.ngrok.io/lock?id=leg100%252Fetok-example%252Fsubdir%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d subdir`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
